import React from 'react'

const AboutUs = () => (
  <section className='flex-grow pt-10 pb-[120px] text-dark'>
    <div className="container">
      <h1 className='text-center text-3xl font-bold mb-4'>О нас</h1>
      <div className='flex flex-col gap-3'>
        <p>
          Компания <strong>«ДН-Групп»</strong>  – один из флагманов рынка металлопроката в Бишкеке и в целом по рынку КР, осуществляющий поставку широкого ассортимента металлических изделий более 10 лет. За это время был накоплен колоссальный опыт работы и выполнено множество нестандартных решений. 
        </p>
        <p>
          ДН-Групп-ваш надёжный поставщик металлопродукции! Мы сэкономим ваше время и деньги! Приобретая металлопрокат в  ДН-Групп, вы можете быть уверены в получении выгодных условий – как при крупных оптовых закупках, так и при небольших партиях для розничных потребностей. Наша цель – создать основу для долгосрочного сотрудничества с вами, и поэтому наши цены и условия всегда остаются на привлекательном и конкурентоспособном уровне.
        </p>
        <p>
          Позвольте нам стать вашим надежным партнером в сфере металлопроката. Свяжитесь с нами уже сегодня, чтобы приобрести необходимый металлопрокат в Кыргызстане и обсудить детали вашего заказа! Мы поможем вам сделать правильный выбор для вашего проекта или производства.
        </p>
      </div>
    </div>
  </section>
)

export default AboutUs
