import { StaticImageData } from "next/image"

export interface IProduct {
  id: number
  title: string
  image: string | StaticImageData
  description: string
  catalog_type: number
}

export const products: IProduct[] = [
  {
    id: 1,
    title: 'Алюминиевый двутавр',
    description: 'ЕвразМеталлКомплект реализует продукцию Алюминиевый двутавр оптом и в розницу. Доставка осуществляется по Кыргызской Республике и в страны СНГ — организует доставку товара до места назначения. Если Вас интересуют объемы и скидки, а также если Вы не нашли нужную позицию – позвоните менеджерам компании, они проконсультируют насчет возможных вариантов.',
    catalog_type: 1,
    image: "https://emk.kg/wp-content/uploads/2021/01/цветно.jpg"
  },
  {
    id: 2,
    title: 'Алюминиевый двутавр 2',
    description: 'ЕвразМеталлКомплект реализует продукцию Алюминиевый двутавр оптом и в розницу. Доставка осуществляется по Кыргызской Республике и в страны СНГ — организует доставку товара до места назначения. Если Вас интересуют объемы и скидки, а также если Вы не нашли нужную позицию – позвоните менеджерам компании, они проконсультируют насчет возможных вариантов.',
    catalog_type: 1,
    image: "https://emk.kg/wp-content/uploads/2021/01/цветно.jpg"
  },
  {
    id: 3,
    title: 'Алюминиевый двутавр 3',
    description: 'ЕвразМеталлКомплект реализует продукцию Алюминиевый двутавр оптом и в розницу. Доставка осуществляется по Кыргызской Республике и в страны СНГ — организует доставку товара до места назначения. Если Вас интересуют объемы и скидки, а также если Вы не нашли нужную позицию – позвоните менеджерам компании, они проконсультируют насчет возможных вариантов.',
    catalog_type: 1,
    image: "https://emk.kg/wp-content/uploads/2021/01/цветно.jpg"
  },
  {
    id: 4,
    title: 'Алюминиевый двутавр 4',
    description: 'ЕвразМеталлКомплект реализует продукцию Алюминиевый двутавр оптом и в розницу. Доставка осуществляется по Кыргызской Республике и в страны СНГ — организует доставку товара до места назначения. Если Вас интересуют объемы и скидки, а также если Вы не нашли нужную позицию – позвоните менеджерам компании, они проконсультируют насчет возможных вариантов.',
    catalog_type: 1,
    image: "https://emk.kg/wp-content/uploads/2021/01/цветно.jpg"
  },
  {
    id: 5,
    title: 'Алюминиевый двутавр 5',
    description: 'ЕвразМеталлКомплект реализует продукцию Алюминиевый двутавр оптом и в розницу. Доставка осуществляется по Кыргызской Республике и в страны СНГ — организует доставку товара до места назначения. Если Вас интересуют объемы и скидки, а также если Вы не нашли нужную позицию – позвоните менеджерам компании, они проконсультируют насчет возможных вариантов.',
    catalog_type: 1,
    image: "https://emk.kg/wp-content/uploads/2021/01/цветно.jpg"
  },
  {
    id: 6,
    title: 'Алюминиевый двутавр 6',
    description: 'ЕвразМеталлКомплект реализует продукцию Алюминиевый двутавр оптом и в розницу. Доставка осуществляется по Кыргызской Республике и в страны СНГ — организует доставку товара до места назначения. Если Вас интересуют объемы и скидки, а также если Вы не нашли нужную позицию – позвоните менеджерам компании, они проконсультируют насчет возможных вариантов.',
    catalog_type: 1,
    image: "https://emk.kg/wp-content/uploads/2021/01/цветно.jpg"
  },
  {
    id: 7,
    title: 'Алюминиевый двутавр 7',
    description: 'ЕвразМеталлКомплект реализует продукцию Алюминиевый двутавр оптом и в розницу. Доставка осуществляется по Кыргызской Республике и в страны СНГ — организует доставку товара до места назначения. Если Вас интересуют объемы и скидки, а также если Вы не нашли нужную позицию – позвоните менеджерам компании, они проконсультируют насчет возможных вариантов.',
    catalog_type: 1,
    image: "https://emk.kg/wp-content/uploads/2021/01/цветно.jpg"
  },
  {
    id: 8,
    title: 'Алюминиевый двутавр 8',
    description: 'ЕвразМеталлКомплект реализует продукцию Алюминиевый двутавр оптом и в розницу. Доставка осуществляется по Кыргызской Республике и в страны СНГ — организует доставку товара до места назначения. Если Вас интересуют объемы и скидки, а также если Вы не нашли нужную позицию – позвоните менеджерам компании, они проконсультируют насчет возможных вариантов.',
    catalog_type: 1,
    image: "https://emk.kg/wp-content/uploads/2021/01/цветно.jpg"
  },
  {
    id: 9,
    title: 'Алюминиевый двутавр 9',
    description: 'ЕвразМеталлКомплект реализует продукцию Алюминиевый двутавр оптом и в розницу. Доставка осуществляется по Кыргызской Республике и в страны СНГ — организует доставку товара до места назначения. Если Вас интересуют объемы и скидки, а также если Вы не нашли нужную позицию – позвоните менеджерам компании, они проконсультируют насчет возможных вариантов.',
    catalog_type: 1,
    image: "https://emk.kg/wp-content/uploads/2021/01/цветно.jpg"
  },
  {
    id: 10,
    title: 'Алюминиевый двутавр 10',
    description: 'ЕвразМеталлКомплект реализует продукцию Алюминиевый двутавр оптом и в розницу. Доставка осуществляется по Кыргызской Республике и в страны СНГ — организует доставку товара до места назначения. Если Вас интересуют объемы и скидки, а также если Вы не нашли нужную позицию – позвоните менеджерам компании, они проконсультируют насчет возможных вариантов.',
    catalog_type: 1,
    image: "https://emk.kg/wp-content/uploads/2021/01/цветно.jpg"
  },
]